app/Http/Controllers/AdminVentasController.php

insert into `venta_detalles` (`venta_id`, `producto_id`, `cantidad`, `precio_venta`, `observaciones`, `updated_at`, `created_at`) values ('5', '2', '7', '3200.00', 'COCACOLA MODAL', '2022-01-20 20:13:32', '2022-01-20 20:13:32')
---
        public function AgregarProductoVentas(Request $request){

				try {
					DB::beginTransaction();

					$idVenta = $request->get('ptxtIdVenta');
					$idproducto = $request->get('ptxtIdProducto');
					$cantidad = $request->get('ptxtCantidad');
					$disponible = $request->get('ptxtDisponible');
					$precio_venta = $request->get('ptxtUltimoPrecio');
					$observaciones = $request->get('ptxtObservacionesDetalles');

					//dd($idVenta, $idproducto, $cantidad, $disponible, $precio_venta, $observaciones);

					if ($idproducto!="" && $cantidad!="" && $cantidad>0 && $precio_venta!="")
                	{

						if($disponible >= $cantidad)
						{

						$detalle = new VentaDetalles();
						$detalle->venta_id= $idVenta;
						$detalle->producto_id= $idproducto;
						$detalle->cantidad= $cantidad;
						$detalle->precio_venta= $precio_venta;
						$detalle->observaciones= $observaciones;

						//dd($detalle);

						$detalle->save();