app/Http/Controllers/AdminProductosController.php

		public function getEdit ($id){
			$data['page_title'] = "Editar Producto";

			$producto = Producto::findOrFail($id);

            //$productos = DB::table('productos')->get();

            $categorias = DB::table('categorias as c')
            ->select('c.*')
            ->where([
                    ['c.estado', '=', 'ACTIVA'],
                    ['c.deleted_at', NULL],
                   ])
            ->groupBy('c.id')
            ->get();
---
select `c`.* from `categorias` as `c` where (`c`.`estado` = 'ACTIVA' and `c`.`deleted_at` is null) group by `c`.`id`