app/Http/Controllers/AdminComprasController.php

select * from `proveedores`
select CONCAT(prod.id, "---",prod.nombre) AS producto_completo, `prod`.`id`, `prod`.`referencia`, `prod`.`stock` from `productos` as `prod` where `prod`.`estado` = 'ACTIVO'
---
        public function getAdd (){
			$data['page_title'] = "REGISTRAR NUEVA COMPRA A ALMACÉN";

			$proveedores = DB::table('proveedores')->get();

  			$productos = DB::table('productos as prod')
  			->select(DB::raw('CONCAT(prod.id, "---",prod.nombre) AS producto_completo'),'prod.id', 'prod.referencia', 'prod.stock')
  			->where('prod.estado','=','ACTIVO')
  			->get();

insert into `compras` (`proveedor_id`, `num_factura`, `fecha_compra`, `responsable_creacion`, `observaciones`, `updated_at`, `created_at`) values ('1', '0001', '2022-01-20T13:00', '', 'OBSERVACIONES ENCABEZADO COMPRA', '2022-01-20 13:02:05', '2022-01-20 13:02:05')
---
        public function store(CompraFormRequest $request){
                        //dd($request->all());
					try{
						DB::beginTransaction();
						$compra=new Compra;
						$compra->proveedor_id=$request->get('slProveedor');
						$compra->num_factura=$request->get('txtFactura');
						$compra->fecha_compra=$request->get('txtFechaCompra');
						$compra->responsable_creacion=$request->get('txtResponsableCreacion');
						$compra->observaciones=$request->get('txtObservaciones');

						//dd($compra);

						$compra->save();

select `c`.`id`, `c`.`num_factura`, `c`.`fecha_compra`, `c`.`responsable_creacion`, `c`.`observaciones`, `p`.`nombres` as `proveedor_compra`, `u`.`name` as `responsable_compra`, sum(cd.cantidad*cd.precio_compra) as total_compra from `compras` as `c` inner join `proveedores` as `p` on `c`.`proveedor_id` = `p`.`id` inner join `compra_detalles` as `cd` on `c`.`id` = `cd`.`compra_id` inner join `cms_users` as `u` on `c`.`responsable_creacion` = `u`.`id` where `c`.`id` = '41' group by `c`.`id` limit 1
select `compra_detalles`.*, `productos`.`nombre` as `nombre_producto` from `compra_detalles` inner join `productos` on `compra_detalles`.`producto_id` = `productos`.`id` where `compra_detalles`.`compra_id` = '41'
---
		public function getDetail ($id){
					$data['page_title'] = "VER DETALLES DE LA COMPRA";

					$compra=DB::table('compras as c')
					->join('proveedores as p','c.proveedor_id','=','p.id')
					->join('compra_detalles as cd','c.id','=','cd.compra_id')
					->join('cms_users as u','c.responsable_creacion','=','u.id')
					->select('c.id','c.num_factura', 'c.fecha_compra', 'c.responsable_creacion','c.observaciones', 'p.nombres as proveedor_compra', 'u.name as responsable_compra', DB::raw('sum(cd.cantidad*cd.precio_compra) as total_compra'))
					->where('c.id','=',$id)
					->groupBy('c.id')
					->first();

					$compraDetalles = DB::table('compra_detalles')
					->join('productos', 'compra_detalles.producto_id', '=', 'productos.id')
					->select('compra_detalles.*', 'productos.nombre as nombre_producto')
					->where('compra_detalles.compra_id', $id)
					->get();